package com.example.korean_story;

public class Data {

    static String[] names = {
            "안병하(1928년 7월 23일 ~ 1988년 10월 10일)",
            "김동연(1957년 1월 28일 ~)",
            "장준하(1915년 10월 5일 ~ 1975년 8월 27일)",
            "김택진(1967년 3월 14일 ~)",
            "윤일선(1896년 10월 5일 ~ 1987년 6월 22일)",
            "석주명(1908년 10월 17일 ~ 1950년 10월 6일)",
            "조병옥(1894년 5월 21일 ~ 1960년 2월 15일)"






    };

    static String[] summary = {
                            "안병하(安炳夏, 1928년 7월 23일 ~ 1988년 10월 10일)는 대한민국의 경찰이다. 제37대 전라남도지방경찰청장을 지냈다. 1980년 5·18 광주 민주화 운동 당시 광주 시민들을 향한 발포 명령을 거부했다가 직위해제된 뒤 보안사령부에서 고문을 당하고 그 후유증으로 1988년 10월 10일 사망했다.\n" +
                            "사후 2005년에 서울 국립현충원에 유해가 안장되었으며, 2006년 국가유공자로 등록되었다. 2017년 11월에는 치안감에 추서되었다\n"+
                            "1949년 육군사관학교 임관(8기)하여 제6사단 포병대에서 근무하던 중, 6·25 전쟁이 발발하였다. 당시 안병하 중위는 위험한 정찰 임무를 수행하여 적의 정확한 위치를 알려 전투를 승리로 이끌었다.(춘천 전투) 이 공으로 1961년 화랑무공훈장을 받았다.\n" +
                            "1962년 육군 중령이던 안병하는 총경 특채로 경찰이 되어 부산 중부경찰서장, 서울 서대문경찰서장을 역임하고, 1968년에는 남파 간첩선을 타고 침투한 북한 무장공비를 소탕한 공로로 중앙정보부장 표창과 녹조근정훈장을 받았다. 1979년 2월 전라남도경찰국장이 되었다.\n" +
                            "1980년 5·18 광주 민주화 운동 당시 안병하 전라남도경찰국장은 시위대에 발포하라는 전두환 신군부의 명령을 거부했다. 그리고 우발적인 사고를 우려해 경찰의 총기를 회수했으며, 시위대에 부상자 치료와 음식 등을 제공하였는데, 이로 인하여 직위 해제되었다.[3] 보안사령부는 그를 연행하여 고문하였고, 안병하는 6월 2일 경찰에서 사직하였다",

                            "1957년 충청북도 음성군에서 유복한 가정에서 태어났으나, 11세 때 아버지가 갑자기 돌아가신 후 가세가 기울어 서울 청계천 무허가 판잣집에서 자랐다. 덕수상업고등학교 야간부를 졸업 후 1976년 한국신탁은행에 취업하였고, 야간대학이었던 국제대학에 진학하였다. 1982년 제6회 입법고시와 제26회 행정고시에 동시에 합격하여 1982년부터 경제기획원에서 공직을 시작했고, 기획예산처에서 주로 근무했다.\n" +
                                    "기획예산처 전략기획관을 하던 2006년(참여정부)에는 변양균 장관 아래서 대한민국 최초의 중장기 전략보고서인 '국가비전2030' 작성의 실무를 총괄하였다.\n" +
                                    "이명박 정부에서 경제금융비서관과 국정과제비서관, 예산실장을 역임한 후 기획재정부 제2차관을 지냈다. 2012년 4월 19대 국회의원 총선거를 앞두고 각 정당이 무상 복지 정책들을 공약했을 때 김동연 차관은 \"제기된 공약을 다 이행하려면 추가 증세와 국채 발행이 불가피하다\"며 무상 보육에 반대하고 보편적 복지 정책을 비판하였다.\n" +
                                    "박근혜 정부의 국무조정실장을 지냈다.\n" +
                                    "2015년부터 제15대 아주대학교 총장을 지냈으며, 재임기간 2년 동안 총 급여 3억 5천만원의 40% 가량인 1억 4천만원을 소외 계층을 위해 기부했다.\n" +
                                    "2017년 6월 문재인 정부에서 경제부총리 겸 기획재정부 장관으로 임명되었다. 경제부총리로 재임하면서 혁신성장과 규제개혁의 중요성을 강조했으며, 소득주도성장만으로는 안 되고 소득주도성장과 혁신성장이 같이 가야 한다고 하였다.\n" +
                                    "2017년 10월 사드로 인한 중국과의 갈등에도 불구하고 한중 통화스와프를 연장시켰으며, 미국의 환율조작국 지정을 막아냈다.2017년 11월 캐나다와도 무제한 통화스와프를 체결했고, 2018년 2월에는 이주열 한국은행 총재와의 공조로 스위스와도 100억 스위스프랑(약 11.6조 원) 규모의 통화스와프를 체결했다.\n" +
                                    "한편 장하성 정책실장과의 갈등설이 돌았다. 두 사람은 최저임금 인상 문제를 비롯해 정책 방향에 대한 이견을 자주 노출했고, 경제 컨트롤타워 혼선 논란이 생겼다. 청와대는 \"두 사람은 정책 방향에 대해 작은 이견이 있는 것뿐\"이라며 \"오히려 건전한 토론이 벌어지는 게 정책 구현에 큰 도움이 된다\"고 갈등설에 대해 해명했고, 두 사람 중 김동연 경제부총리가 컨트롤타워라고 입장을 밝혔다. 2018년 7월 두 사람은 2주에 1번씩 만나 정부의 경제정책 방향에 대한 의견을 주고받기로 하였다.\n" +
                                    "2018년 8월 삼성전자를 방문해 이재용 부회장을 만났다. 그러나 정부가 '재벌그룹 팔 비틀기'에 나선다는 비판이 제기되면서, 삼성의 투자·고용 확대 계획 등은 발표되지 않았다.\n" +
                                    "2018년 9월 문재인 대통령은 미국을 방문하고 이낙연 국무총리는 쩐다이꽝 베트남 주석 조문을 위해 베트남 하노이를 방문하면서, 김동연 경제부총리가 대행체제를 맡았다.\n" +
                                    "그러나 가시적인 경제 성과를 내지 못한데다가 장하성 청와대 정책실장과의 갈등설이 지속적으로 제기되면서, 2018년 11월 장하성 정책실장과 동시에 경질되었다. 후임에는 홍남기 국무조정실장이 지명되었다.\n" +
                                    "그는 2013년 국무조정실장으로 재직할 때, 28세이던 아들이 백혈병으로 사망하였는데 아들 장례식 당일에 업무에 복귀해 당시 국조실이 만든 ‘원전비리 종합대책’을 직접 발표했다. 그는 당시 주변에 아들의 투병 사실도 알리지 않았고, 아들의 부고조차 내지 않고 부의금도 받지 않았다.\n" +
                                    "김동연 아주대 총장이 경제부총리 내정자로 지정된 이후, 학내에서는 김 총장이 임기 도중에 학교를 떠나 아쉽다고 입을 모았다. 익명의 한 학생은 \"총장 임기 시작과 동시에 여러 활동을 통해 학생들과 함께하고 학생들의 뜻을 존중하는 모습이 감동적\"이었다며 \"마땅히 보내드려야 한다고 생각하지만 아쉽기도 하다\"고 했다. 채 아주대 총학생회장은 \"김 총장님은 학생들이 더 많은 경험을 할 수 있도록 글로벌 인턴쉽, After you, 파란학기 등 다양한 프로그램을 진행했다\"며 \"한 달에 한 번씩 브라운 백 미팅을 열어 학생들과 점심을 함께 먹으며 건의사항을 직접 듣는 등 항상 소통하기 위해 노력했다\"고 말했다. 정영기 아주대 교수회장은 \"총장이 나라의 중책을 맡아 학교의 위상을 드높이게 될 것이라는 의견도 있지만 동시에 총장이 임기를 채우지 못해 떠나게 돼 아쉽다는 지적도 있다\"고 전했다.\n" +
                                    "2018년 5월 7일 한국경제신문이 각계 전문가 140명을 대상으로 한 설문조사 결과, 김동연 부총리는 청와대 및 행정부 경제라인 업무 평가(10점 만점)에서 평가 대상인 10명 가운데 가장 높은 7.01점을 받았다. 정부 경제정책 영향력이 가장 큰 인물로는 장하성 정책실장으로 꼽혔고, 김동연 부총리는 2위를 차지했다.\n" +
                                    "2018년 5월 8일 머니투데이 the300이 국회의원·보좌진 345명을 상대로 실시한 장관 평가 결과, 김동연 부총리는 18명의 장관(2명의 위원장 포함)들 중 5위를 차지했다. 1~3위는 국회의원 출신 장관들이 차지했으며, 김 부총리는 관료 출신 장관들 가운데서는 2번째로 높은 등수를 기록했다.",

                                    "평안북도 삭주 출생. 아버지는 장로교 목사인 장석인(張錫仁)이다. 1944년 일본군에 징집되어 중국 쓰저우[徐州] 지구에 배속되었으나 6개월 만에 탈출해 한국광복군간부훈련반에서 훈련을 받았다. 1945년 1월 충칭[重慶]의 대한민국임시정부에 도착하여, 곧바로 한국광복군 제2지대에 배속되었다. 특히 미국 전략정보국(OSS: Office of Strategic Services)이 주관하는 특별군사훈련을 받고 국내에 특파되었으나 작전 도중 일본의 항복 소식을 듣고 돌아갔다. 광복 이후 잡지 『사상계』를 간행하였고, 민주화운동에 활발하게 나섰다. 이 과정에서 여러 차례 투옥되었으나, 옥중 당선으로 제7대 국회의원에 당선되었다. 유신체제 반대운동을 주도하던 중 1975년 의문의 등산 사고로 사망했다.\n" +
                                            "일본 도요대학[東洋大學] 예과를 거쳐 도쿄의 니혼신학교[日本神學校]에서 수학하던 중 1944년 일본군 학도병에 강제 징집되었다. 이후 중국 쓰저우 지구에 배속되었으나, 6개월 만에 탈출에 성공하여 김준엽(金俊燁)의 도움으로 중국의 중국중앙군관학교(中國中央軍官學校) 린취안(臨泉) 분교 한국광복군간부훈련반(약칭 한광반)에 입대했다. 이곳에서 훈련을 받으면서 여가를 이용해 잡지 『등불』을 발간했다. 한광반의 훈련에 한계를 느끼고 충칭에 있는 대한민국임시정부에 합류하기로 계획했다. 2개월간 혹한, 배고픔과 사투를 벌인 끝에 1945년 1월 30일 충칭의 대한민국임시정부에 도착했다.\n" +
                                            "도착 후 시안[西安]의 한국광복군 제2지대 이범석(李範奭) 휘하에 배속되었고, 유엔군 중국전구사령부(中國戰區司令部) 웨드마이어(Wedemeyer, A. C.) 휘하에서 미국 전략정보국이 주관하는 한미합작 특별군사훈련을 받았다. 특히 국내의 후방에 침투할 목적으로 조직된 국내정진군(國內挺進軍)에 자원해 수송기를 타고 작전에 투입되었으나, 일본 항복 소식을 듣고 귀환했다. 한편 이곳에서도 교포들의 친목잡지인『제단(祭壇)』초판 300부를 발간했다. 광복이 되자 대한민국임시정부 주석 김구의 비서로, 1945년 12월 김구와 함께 조국에 돌아왔다.\n" +
                                            "1946년 조선민족청년단 중앙훈련소 교무처장이 되었으나, 학업을 마치기 위해 한국신학대학에서 수학했다. 1951년 1·4후퇴 때 부산에 피난한 뒤 1952년 9월 문교부 산하의 국민사상연구원에서 잡지 『사상』을 창간했다. 이어 1953년 피난지에서 『사상계(思想界)』를 창간했다.\n" +
                                            "1966년 대통령명예훼손 혐의로 검거되어 복역하였다. 이듬해 1967년 서울 동대문 을구에서 신민당 공천으로 옥중 출마해 제7대 국회의원에 당선되었다. 1971년 신민당을 탈당하고 사상계 사장에 복귀했으며, 1973년 통일당 최고위원이 되었다. 1974년 긴급조치 제1호 위반으로 징역 15년형을 선고받았으나 형집행정지로 가석방되었다. 연이은 민주화운동 참가로 10여 차례 투옥되었다. 1975년 개헌청원백만인서명운동본부의 이름으로「박정희 대통령에게 보내는 공개서한」을 발표했다. 주요 내용은, 대통령 자신이 개헌을 발의해서 완전한 민주헌법을 만들고 그 헌법에 따라 자신의 거취를 정할 것과 긴급조치로 구속된 민주인사와 학생을 무조건 즉시 석방하고 자유언론을 보장하라는 것이었다.\n" +
                                            "그러나 1975년 8월 17일 경기도 포천군에 있는 약사봉에서 등산하다가 의문의 사고로 사망했다. 이후 사망 경위에 대해 논란이 분분했다. 2002년 의문사진상규명위원회에서 사망경위를 조사했으나, 변사사건기록 폐기, 수사관련 경찰관들의 사망, 국가정보원 자료의 미확보 등으로 2004년 그의 사망이 공권력의 직·간접적 행사에 의한 것인지 확인이 불가능하다는 결론이 내려졌다. 그러나 2012년 8월 묘지를 이장하는 과정에서 두개골 함몰 흔적이 발견되어 언론의 집중적인 관심을 받았다. 저서로 『돌베개』가 있다.",

            "이찬진 등과 더불어 한글과컴퓨터 창립 멤버이자 억만장자. 서울대학교 전자공학과(85학번) 재학 당시 대학생 동아리에서 한글과컴퓨터를 창업했으며, 이후 한메소프트를 창업하기도 했다. 서울대학교 대학원에서 박사과정을 하다 중간에 그만뒀다. 현대전자에서 일하던 중 1997년 회사를 그만두고 엔씨소프트를 창업하여 '리니지'를 내놓았다. 리니지의 대성공으로 억만장자의 반열에 오른다. 어느 날부터 재산이 대강 1조 3000억 정도로 불었고, 연봉도 21억까지 올랐다. 이 시절엔 야구팬들에게 택진이형 소리를 들을 줄 그 누구도 몰랐다\n" +
                    "2010년대 후반에는 모바일게임 리니지M 출시를 통해 국내 모바일게임 사상 최대 흥행기록을 써내려가며 막대한 수익을 올리고 있다. 리니지 출시 19년 만에 모바일로 2017년 6월 21일 출시된 리니지M은 출시하자마자 구글 플레이스토어 1위에 올라 1년 내내 1위를 지키며 누적 매출 1조 원을 달성하는 대성공을 거뒀다.\n" +
                    "서브컬처에 관심이 많은지, 엔씨소프트는 웹소설이나 웹툰에 많이 투자하는 상태다. 레진코믹스에 50억 원이나 투자하고, 2015년에는 RS미디어라는 신생 웹소설 사이트에도 20억을 투자할 정도로 유명한 사람이다.[5] 이후 2011년 8월 KBO 리그 제 9구단으로 NC 다이노스를 창단하며 야구계에도 투자하기 시작했다.\n" +
                    "검소하고 소탈한 성격이나 사업적으로는 승부사적 기질이 뛰어나다는 평을 듣고 있다.",

            "윤일선(尹日善, 1896년 10월 5일 ~ 1987년 6월 22일)은 일제 강점기와 대한민국의 의사, 대학교수, 대학총장, 사회 운동가이다. 서울대학교 총장을 지냈다.\n" +
                    "일본 교토 제국대학교(京都帝國大學校)에서 수학한 후 귀국, 세브란스 의과 대학과 서울대학교 의학부에서 교수로 활동했으며, 전공으로는 병리학과 해부학, 암 연구 분야였다. 대한민국학술원의 원로 회원이자 초대 원장이었으며, 서울대학교 의과대학 학장, 1954년 서울대학교 부총장, 1956년 총장, 1961년 서울대 의대 강사와 명예교수를 지냈다. 1956년부터 1973년까지는 암연구회 회장을 지냈다.\n" +
                    "1963년 1월 박정희 등의 군정에 참여한 뒤로는 공화당 창립에 참여하고, 1964년 9월과 이듬해 1965년 9월에 오스트리아 빈에서 개최된 국제원자력기구(IAEA) 총회 한국대표로 두 차례 다녀왔으며, 과학기술후원회 이사장과 과학기술재단이사장 등을 역임하였다. 윤영렬의 손자이자 대한제국의 관료이자 교육자인 윤치오의 첫째 아들이다. 윤승선의 형이며, 대한민국 4대 대통령을 지낸 윤보선(尹潽善)의 사촌 형이며, 구한말의 개혁정치가 윤치호의 당질이다. 그밖에 함께 의사로 활동한 윤치왕이 그의 당숙이고, 윤유선은 그의 사촌 동생이다.\n" +
                    "그는 한국 최초의 병리학자이기도 했고, 경성제국대학(서울대학교의 전신)에서는 한국인 최초의 의학박사들을 양성하였다. 그는 대학 교수와 학생들이 직접 선출한 최초의 비(非)관선 서울대학교 총장이었다. 일본 도쿄에서 출생하였고 지난날 한때 일본 긴키 지방 교토에서 잠시 유아기를 보낸 적이 있으며 일본 도쿄를 떠나 대한제국으로 귀국 후 충청남도 아산군을 거쳐 한성부에서 잠시 유년기를 보낸 적이 있다. 본관은 해평이며, 아호는 동호(東湖)이다."

            ,"1908년 평양에서 태어났다. 아버지는 평양 시내에 종업원이 100여 명에 달하는 요리집을 운영할 정도로 부유한 사업가였는데, 사업으로 번 돈으로 독립 운동을 지원할 만큼 민족의식이 뚜렷했다. 어머니는 당시에는 귀한 신식 물자인 타자기를 구해줄 정도로 자식 교육에 많은 열정을 보였다. 이러한 가정 환경은 석주명이 민족 문제와 학문 연구에 관심을 갖게 했다.\n" +
            "어릴 때부터 토끼, 비둘기와 같은 동물을 좋아해 집에서 길렀으며, 1921년 장로교 선교사 베어드가 세운 숭실고등보통학교에 진학했다. 하지만 동맹휴학에 가담하여 개성의 송도고등보통학교로 학교를 옮겼으며, 다시 경상북도 대구 고등농림학교로 전학하였고 1927년에 졸업했다.\n" +
            "송도고보 학생 시절에 석주명은 집에서 떠나서 공부했는데, 한때 음악에 정신이 팔려 공부를 게을리 하기도 했다. 집에서 많은 생활비를 보내 주는 데다가, 공부를 감독할 부모가 옆에 없었기 때문이다.\n" +
            "당연히 낙제 과목이 나올 정도로 성적이 나쁘게 나오자, 그제서야 정신을 차리고 방학 동안 공부에 힘썼다. 일본 최고의 농업 전문 학교의 하나인 가고시마 고등농림학교(鹿兒島高等農林學敎)에서 공부하여 1929년 졸업하였다.\n" +
            "석주명은 타이완에서 곤충 채집 여행 때 비를 맞지 않으려고 나무에 모인 하루살이들을 채집할 만큼 끈기가 있는 학생이었다. 일본 가고시마 고등농림학교 졸업 후에는 송도중학교에서 생물 교사로 일하면서 한반도의 나비에 대해서 연구했다.\n" +
            "이는 가고시마 고등농림학교 재학 시 지도 교수였던 오카지마 교수의 충고에 따른 것이었다. 일본 가고시마 고등농림학교를 졸업할 즈음의 석주명에게 교수는 장래를 물었는데, 석주명은 차별 때문에 학자가 될 수 없다고 하였다. 그러자 교수는 “한 분야에 10년간 집중하면 그 분야의 전문가가 된다”며 한반도에 사는 나비 연구를 권했고, 석주명은 교수의 충고를 받아들여 나비를 연구하였다.\n" +
            "한국 전쟁 도중 1950년 9월 말 서울에 있던 서울과학관이 폭격을 맞으면서 그가 20여 년 동안 75만 마리의 나비를 채집하여 만든 나비 표본이 모두 잿더미가 되고 말았다. 당시 석주명은 너무 상심이 커서 식음을 전폐할 정도였다. 석주명 자신도 1950년 10월 6일 조선인민군으로 오인을 받아 총격을 당하여 세상을 떠나고 말았다. 그의 나이는 당시 41세였다. 이후 제자들이 거적에 싸인 시체를 발견하였다.\n" +
            "\n" +
            "1931년부터 나비 연구를 시작한 그는 일본 동물학자들의 잘못된 나비 분류를 바로잡았다. 생물분류학의 새 장을 연 ‘개체변이에 따른 분포곡선 이론’을 창안해 내었던 것이다. 당시 일본인 동물학자들은 조금만 다른 특징이 있으면 새로운 종류라고 주장하여 한국의 나비가 844종이라고 과장하고 있었다. 그런데, 석주명은 영국 왕립아시아협회 조선지부에서 발간한 A Synonmic List of Butterflies of Korea 〈조선산 접류 총목록〉(1940년)을 통해 한국의 나비는 248종이라고 바로잡았다.\n" +
            "\n" +
            "당시 석주명은 배추흰나비 16만여 마리의 무늬를 비교했는데, 그 결과 무늬가 다르다고 하여 다른 종이라고 성급하게 판단해서는 안 된다는 결론을 얻었다. 나비는 같은 종류라고 할지라도 성, 계절 등에 따라 몸의 크기와 무늬가 다르다. 그런데도 성급하게 무늬와 색상만으로 다른 종류라고 잘못 생각하던 일본 학자들의 관행을 바로 잡은 것이다. 나비의 분류에 관한 80편이 넘는 논문을 남겼다.\n" +
            "\n" +
            "또한 제주 방언에 대한 논문과 에스페란토어 교과서를 쓰는 등 언어학자로도 활동했다. 또한 1943년 4월부터 1945년 5월까지 서귀포에 있던 경성제국대학 생약연구소 제주도시험장에서 근무하면서 <제주도방언집>, <제주도생명조사서>, <제주도관계문헌집> 등 6권(<제주도수필>, <제주도곤충상>, <제주도자료집>은 유고집)의 제주도총서를 발간하여 제주도에 관한 것은 무엇이든 기록하고 정리하여, 일명 제주도학(濟州島學)의 선구자로 불린다. 1945년에는 국립과학박물관 동물학부장과 국학대학에서 강사직을 맡기도 하였다.\n" +
            "\n" +
            "석주명은 나비들의 이름을 붙여주었는데, 그가 붙여준 나비 이름으로는 신부나비(천주교 신부들의 예복을 연상한 이름), 도시처녀나비, 유리창나비, 수노랑나비, 부전나비(부전은 어린이들의 장식용 노리개를 말한다고 하는데, 실제로 부전나비는 몸집이 작아서 귀엽고, 날개색상이 화려해서 예쁜 나비이다.), 깊은산부전나비, 기생나비(흰나비의 하나, 기생처럼 가늘고 아름다운 몸놀림을 생각하면서 붙인 이름이라고 한다.), 배추흰나비(애벌레 시절에 배추를 먹는다 하여 붙인 이름이다.) 등 다양하며, 학명에 그의 성씨인 ‘석’(Seok)을 붙였다.\n" +
            "\n" +
            "1940년에 낸 나비에 관한 그의 저서는 현재 사이트 영국왕립학회(The Royal Society of London for the Improvement of Natural Knowledge) 도서관에 소장되어 있다. 세계에 30여 명밖에 안되는 세계나비학회의 회원이 되었다. 전국 방방곡곡을 다니며 75만여 마리나 되는 나비를 채집하여 분류하고 연구했다. 또 그 성과를 모두 정리하여 지도에 표시(《한국산 접류 분포도》)했는데, 이것은 세계의 걸작으로 손꼽히고 있다.\n" +
            "\n" +
            "1947년 한국산악회의 독도 학술 조사에 참가했다. 그물코에서 펴낸 석주명 평전에 따르면, 누이동생 석주선이 한국 전쟁 피난 시절 배낭에 넣고 다니며 보존했다가 1973년에 발간한 《한국산 접류 분포도》(The Distribution Maps of Butterflies in Korea)는 대한민국 나비 250종이 분포하는 지역을 종마다 각각 한국 지도와 세계 지도 한 장씩에 붉은 점으로 표시한 지도 500장으로 편집되어 있다. 석주명의 유품 및 관련 사료 50여 점은 단국대학교 석주선기념박물관에 소장되어 있다.\n" +
            "\n" +
            "죽기 직전에 석주명은 “나는 나비밖에 모르는 사람”이라고 말했다고 한다."
            ,"조병옥(趙炳玉, 1894년 5월 21일 충청남도 천안 ~ 1960년 2월 15일 미국)은 대한민국의 독립운동가, 교육자, 경찰관, 정치가이다. 일제 강점기 초반 도미유학과 독립운동에 종사하였고, 안창호에게 감화되어 그의 흥사단과 수양동지회, 국민회 일에 적극 참여하였다. 그 뒤 태평양 전쟁 무렵 수양동우회 사건 등으로 두 차례나 옥고를 치렀다. 해방 정국에서는 한민당 창당에 참여한 뒤 미군정의 경찰총수를 지냈으며, 1948년 정부수립 후에는 UN대표단, 내무부 장관 등을 거친 뒤 이승만과 결별했다. 해방 직후 미군정 치하 제2대 경찰 통수권자였고 장택상과 더불어 친일경찰들을 재등용한 사람 중 한명이다.\n" +
            "\n" +
            "한국민주당과 민주국민당에서 활동하였으며, 1954년 호헌동지회에 참여하였으며, 민주당에 입당, 신익희·윤보선·유진산 등과 함께 민주당 구파의 리더로 활동하였다. 1950년 대한민국의 제2대 정·부통령 선거에 부통령 후보자로 출마하였으나 낙선하였고, 1960년 대한민국 제4대 대통령 후보자로 출마하였으나 선거유세 중 병으로 미국 워싱턴 D. C. 월터리드 육군병원에 입원했다가 급서하였다. 제1공화국 후반 여야의 갈등이 첨예하게 대립할 때 장택상, 이기붕 등과 수시로 만나 회담, 절충을 주도하였으며, 기자들이나 강경투쟁을 요청하는 야당인사들에게 하던 “빈대잡기 위해 초가삼간 태울 수는 없지 않느냐”는 말은 회자화되었다. 본관은 한양, 충청남도 천안시에서 태어났으며, 호는 유석(維石)이다."




    };

}
