package com.example.korean_story;

public class Data {

    static String[] names = {
            "안병하(安炳夏, 1928년 7월 23일 ~ 1988년 10월 10일)",
            "김동연(金東兗, 1957년 1월 28일 ~)",
            "장준하(張俊河, 1915년 10월 5일 ~ 1975년 8월 27일)"



    };

    static String[] summary = {
                            "안병하(安炳夏, 1928년 7월 23일 ~ 1988년 10월 10일)는 대한민국의 경찰이다. 제37대 전라남도지방경찰청장을 지냈다. 1980년 5·18 광주 민주화 운동 당시 광주 시민들을 향한 발포 명령을 거부했다가 직위해제된 뒤 보안사령부에서 고문을 당하고 그 후유증으로 1988년 10월 10일 사망했다.\n" +
                            "사후 2005년에 서울 국립현충원에 유해가 안장되었으며, 2006년 국가유공자로 등록되었다. 2017년 11월에는 치안감에 추서되었다\n"+
                            "1949년 육군사관학교 임관(8기)하여 제6사단 포병대에서 근무하던 중, 6·25 전쟁이 발발하였다. 당시 안병하 중위는 위험한 정찰 임무를 수행하여 적의 정확한 위치를 알려 전투를 승리로 이끌었다.(춘천 전투) 이 공으로 1961년 화랑무공훈장을 받았다.\n" +
                            "1962년 육군 중령이던 안병하는 총경 특채로 경찰이 되어 부산 중부경찰서장, 서울 서대문경찰서장을 역임하고, 1968년에는 남파 간첩선을 타고 침투한 북한 무장공비를 소탕한 공로로 중앙정보부장 표창과 녹조근정훈장을 받았다. 1979년 2월 전라남도경찰국장이 되었다.\n" +
                            "1980년 5·18 광주 민주화 운동 당시 안병하 전라남도경찰국장은 시위대에 발포하라는 전두환 신군부의 명령을 거부했다. 그리고 우발적인 사고를 우려해 경찰의 총기를 회수했으며, 시위대에 부상자 치료와 음식 등을 제공하였는데, 이로 인하여 직위 해제되었다.[3] 보안사령부는 그를 연행하여 고문하였고, 안병하는 6월 2일 경찰에서 사직하였다",

                            "1957년 충청북도 음성군에서 유복한 가정에서 태어났으나, 11세 때 아버지가 갑자기 돌아가신 후 가세가 기울어 서울 청계천 무허가 판잣집에서 자랐다. 덕수상업고등학교 야간부를 졸업 후 1976년 한국신탁은행에 취업하였고, 야간대학이었던 국제대학에 진학하였다. 1982년 제6회 입법고시와 제26회 행정고시에 동시에 합격하여 1982년부터 경제기획원에서 공직을 시작했고, 기획예산처에서 주로 근무했다.\n" +
                                    "기획예산처 전략기획관을 하던 2006년(참여정부)에는 변양균 장관 아래서 대한민국 최초의 중장기 전략보고서인 '국가비전2030' 작성의 실무를 총괄하였다.\n" +
                                    "이명박 정부에서 경제금융비서관과 국정과제비서관, 예산실장을 역임한 후 기획재정부 제2차관을 지냈다. 2012년 4월 19대 국회의원 총선거를 앞두고 각 정당이 무상 복지 정책들을 공약했을 때 김동연 차관은 \"제기된 공약을 다 이행하려면 추가 증세와 국채 발행이 불가피하다\"며 무상 보육에 반대하고 보편적 복지 정책을 비판하였다.\n" +
                                    "박근혜 정부의 국무조정실장을 지냈다.\n" +
                                    "2015년부터 제15대 아주대학교 총장을 지냈으며, 재임기간 2년 동안 총 급여 3억 5천만원의 40% 가량인 1억 4천만원을 소외 계층을 위해 기부했다.\n" +
                                    "2017년 6월 문재인 정부에서 경제부총리 겸 기획재정부 장관으로 임명되었다. 경제부총리로 재임하면서 혁신성장과 규제개혁의 중요성을 강조했으며, 소득주도성장만으로는 안 되고 소득주도성장과 혁신성장이 같이 가야 한다고 하였다.\n" +
                                    "2017년 10월 사드로 인한 중국과의 갈등에도 불구하고 한중 통화스와프를 연장시켰으며, 미국의 환율조작국 지정을 막아냈다.2017년 11월 캐나다와도 무제한 통화스와프를 체결했고, 2018년 2월에는 이주열 한국은행 총재와의 공조로 스위스와도 100억 스위스프랑(약 11.6조 원) 규모의 통화스와프를 체결했다.\n" +
                                    "한편 장하성 정책실장과의 갈등설이 돌았다. 두 사람은 최저임금 인상 문제를 비롯해 정책 방향에 대한 이견을 자주 노출했고, 경제 컨트롤타워 혼선 논란이 생겼다. 청와대는 \"두 사람은 정책 방향에 대해 작은 이견이 있는 것뿐\"이라며 \"오히려 건전한 토론이 벌어지는 게 정책 구현에 큰 도움이 된다\"고 갈등설에 대해 해명했고, 두 사람 중 김동연 경제부총리가 컨트롤타워라고 입장을 밝혔다. 2018년 7월 두 사람은 2주에 1번씩 만나 정부의 경제정책 방향에 대한 의견을 주고받기로 하였다.\n" +
                                    "2018년 8월 삼성전자를 방문해 이재용 부회장을 만났다. 그러나 정부가 '재벌그룹 팔 비틀기'에 나선다는 비판이 제기되면서, 삼성의 투자·고용 확대 계획 등은 발표되지 않았다.\n" +
                                    "2018년 9월 문재인 대통령은 미국을 방문하고 이낙연 국무총리는 쩐다이꽝 베트남 주석 조문을 위해 베트남 하노이를 방문하면서, 김동연 경제부총리가 대행체제를 맡았다.\n" +
                                    "그러나 가시적인 경제 성과를 내지 못한데다가 장하성 청와대 정책실장과의 갈등설이 지속적으로 제기되면서, 2018년 11월 장하성 정책실장과 동시에 경질되었다. 후임에는 홍남기 국무조정실장이 지명되었다.\n" +
                                    "그는 2013년 국무조정실장으로 재직할 때, 28세이던 아들이 백혈병으로 사망하였는데 아들 장례식 당일에 업무에 복귀해 당시 국조실이 만든 ‘원전비리 종합대책’을 직접 발표했다. 그는 당시 주변에 아들의 투병 사실도 알리지 않았고, 아들의 부고조차 내지 않고 부의금도 받지 않았다.\n" +
                                    "김동연 아주대 총장이 경제부총리 내정자로 지정된 이후, 학내에서는 김 총장이 임기 도중에 학교를 떠나 아쉽다고 입을 모았다. 익명의 한 학생은 \"총장 임기 시작과 동시에 여러 활동을 통해 학생들과 함께하고 학생들의 뜻을 존중하는 모습이 감동적\"이었다며 \"마땅히 보내드려야 한다고 생각하지만 아쉽기도 하다\"고 했다. 채 아주대 총학생회장은 \"김 총장님은 학생들이 더 많은 경험을 할 수 있도록 글로벌 인턴쉽, After you, 파란학기 등 다양한 프로그램을 진행했다\"며 \"한 달에 한 번씩 브라운 백 미팅을 열어 학생들과 점심을 함께 먹으며 건의사항을 직접 듣는 등 항상 소통하기 위해 노력했다\"고 말했다. 정영기 아주대 교수회장은 \"총장이 나라의 중책을 맡아 학교의 위상을 드높이게 될 것이라는 의견도 있지만 동시에 총장이 임기를 채우지 못해 떠나게 돼 아쉽다는 지적도 있다\"고 전했다.\n" +
                                    "2018년 5월 7일 한국경제신문이 각계 전문가 140명을 대상으로 한 설문조사 결과, 김동연 부총리는 청와대 및 행정부 경제라인 업무 평가(10점 만점)에서 평가 대상인 10명 가운데 가장 높은 7.01점을 받았다. 정부 경제정책 영향력이 가장 큰 인물로는 장하성 정책실장으로 꼽혔고, 김동연 부총리는 2위를 차지했다.\n" +
                                    "2018년 5월 8일 머니투데이 the300이 국회의원·보좌진 345명을 상대로 실시한 장관 평가 결과, 김동연 부총리는 18명의 장관(2명의 위원장 포함)들 중 5위를 차지했다. 1~3위는 국회의원 출신 장관들이 차지했으며, 김 부총리는 관료 출신 장관들 가운데서는 2번째로 높은 등수를 기록했다.",

                                    "평안북도 삭주 출생. 아버지는 장로교 목사인 장석인(張錫仁)이다. 1944년 일본군에 징집되어 중국 쓰저우[徐州] 지구에 배속되었으나 6개월 만에 탈출해 한국광복군간부훈련반에서 훈련을 받았다. 1945년 1월 충칭[重慶]의 대한민국임시정부에 도착하여, 곧바로 한국광복군 제2지대에 배속되었다. 특히 미국 전략정보국(OSS: Office of Strategic Services)이 주관하는 특별군사훈련을 받고 국내에 특파되었으나 작전 도중 일본의 항복 소식을 듣고 돌아갔다. 광복 이후 잡지 『사상계』를 간행하였고, 민주화운동에 활발하게 나섰다. 이 과정에서 여러 차례 투옥되었으나, 옥중 당선으로 제7대 국회의원에 당선되었다. 유신체제 반대운동을 주도하던 중 1975년 의문의 등산 사고로 사망했다.\n" +
                                            "일본 도요대학[東洋大學] 예과를 거쳐 도쿄의 니혼신학교[日本神學校]에서 수학하던 중 1944년 일본군 학도병에 강제 징집되었다. 이후 중국 쓰저우 지구에 배속되었으나, 6개월 만에 탈출에 성공하여 김준엽(金俊燁)의 도움으로 중국의 중국중앙군관학교(中國中央軍官學校) 린취안(臨泉) 분교 한국광복군간부훈련반(약칭 한광반)에 입대했다. 이곳에서 훈련을 받으면서 여가를 이용해 잡지 『등불』을 발간했다. 한광반의 훈련에 한계를 느끼고 충칭에 있는 대한민국임시정부에 합류하기로 계획했다. 2개월간 혹한, 배고픔과 사투를 벌인 끝에 1945년 1월 30일 충칭의 대한민국임시정부에 도착했다.\n" +
                                            "도착 후 시안[西安]의 한국광복군 제2지대 이범석(李範奭) 휘하에 배속되었고, 유엔군 중국전구사령부(中國戰區司令部) 웨드마이어(Wedemeyer, A. C.) 휘하에서 미국 전략정보국이 주관하는 한미합작 특별군사훈련을 받았다. 특히 국내의 후방에 침투할 목적으로 조직된 국내정진군(國內挺進軍)에 자원해 수송기를 타고 작전에 투입되었으나, 일본 항복 소식을 듣고 귀환했다. 한편 이곳에서도 교포들의 친목잡지인『제단(祭壇)』초판 300부를 발간했다. 광복이 되자 대한민국임시정부 주석 김구의 비서로, 1945년 12월 김구와 함께 조국에 돌아왔다.\n" +
                                            "1946년 조선민족청년단 중앙훈련소 교무처장이 되었으나, 학업을 마치기 위해 한국신학대학에서 수학했다. 1951년 1·4후퇴 때 부산에 피난한 뒤 1952년 9월 문교부 산하의 국민사상연구원에서 잡지 『사상』을 창간했다. 이어 1953년 피난지에서 『사상계(思想界)』를 창간했다.\n" +
                                            "1966년 대통령명예훼손 혐의로 검거되어 복역하였다. 이듬해 1967년 서울 동대문 을구에서 신민당 공천으로 옥중 출마해 제7대 국회의원에 당선되었다. 1971년 신민당을 탈당하고 사상계 사장에 복귀했으며, 1973년 통일당 최고위원이 되었다. 1974년 긴급조치 제1호 위반으로 징역 15년형을 선고받았으나 형집행정지로 가석방되었다. 연이은 민주화운동 참가로 10여 차례 투옥되었다. 1975년 개헌청원백만인서명운동본부의 이름으로「박정희 대통령에게 보내는 공개서한」을 발표했다. 주요 내용은, 대통령 자신이 개헌을 발의해서 완전한 민주헌법을 만들고 그 헌법에 따라 자신의 거취를 정할 것과 긴급조치로 구속된 민주인사와 학생을 무조건 즉시 석방하고 자유언론을 보장하라는 것이었다.\n" +
                                            "그러나 1975년 8월 17일 경기도 포천군에 있는 약사봉에서 등산하다가 의문의 사고로 사망했다. 이후 사망 경위에 대해 논란이 분분했다. 2002년 의문사진상규명위원회에서 사망경위를 조사했으나, 변사사건기록 폐기, 수사관련 경찰관들의 사망, 국가정보원 자료의 미확보 등으로 2004년 그의 사망이 공권력의 직·간접적 행사에 의한 것인지 확인이 불가능하다는 결론이 내려졌다. 그러나 2012년 8월 묘지를 이장하는 과정에서 두개골 함몰 흔적이 발견되어 언론의 집중적인 관심을 받았다. 저서로 『돌베개』가 있다."
    };

}
